microchip-pic-avr-examples/pic18f57q43-audio-record-playback/pic18f56q43-audio-record-playback-melody.X/main.c
/**
  Generated Main Source File

  Company:
    Microchip Technology Inc.

  File Name:
    main.c

  Summary:
    This is the main file generated using PIC10 / PIC12 / PIC16 / PIC18 MCUs

  Description:
    This header file provides implementations for driver APIs for all modules selected in the GUI.
    Generation Information :
        Product Revision  :  PIC10 / PIC12 / PIC16 / PIC18 MCUs - 1.79.0
        Device            :  PIC18F57Q43
        Driver Version    :  2.00
*/

/*
    (c) 2018 Microchip Technology Inc. and its subsidiaries. 
    
    Subject to your compliance with these terms, you may use Microchip software and any 
    derivatives exclusively with Microchip products. It is your responsibility to comply with third party 
    license terms applicable to your use of third party software (including open source software) that 
    may accompany Microchip software.
    
    THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER 
    EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY 
    IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS 
    FOR A PARTICULAR PURPOSE.
    
    IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, 
    INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND 
    WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP 
    HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO 
    THE FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL 
    CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT 
    OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS 
    SOFTWARE.
*/

#include <pic18.h>

#include "mcc_generated_files/system/system.h"




// DEBUG Macros
#define DBG_ENABLE              true       // Enable/disable debug function calls
#if DBG_ENABLE
    #define DBG(x) x
#else
    #define DBG(x) 
#endif

// LED Marcos
#define LED0_TurnOn             LED0_SetLow
#define LED0_TurnOff            LED0_SetHigh

// DMA Macros
#define MAX_DMA                 6           // Max number of DMAs being used
#define DMA1                    0           // ADC to DAC               // Passthrough
#define DMA2                    1           // ADC to PingPong          // Record
#define DMA3                    2           // SPI to DAC               // Playback
#define DMA4                    3           // PingPong to SPI          // Record
#define DMA5                    4           // PingPong to BufferRAM    // Record
#define DMA6                    5           // PFM to DAC               // Playback
#define DMA7                    6           // Unused - not available in Q43
#define DMA8                    7           // Unused - not available in Q43

// Memory Macros and variables
#define GPR_PFM_BLOCK_SIZE      256         // Bank size of GPR space in bytes
#define PFM_AUDIO_START_ADDR    0x4500      // Start address of audio#1 in flash
#define PFM_AUDIO_END_ADDR      0x01FEFF    // Last address available in PFM for audio storage (excludes SAF)
#define PFM_AUDIO_SIZE_PAGES    440         // Size of each audio in pages // from 0x4000 440 pages reached last-1 page // 192 pages reaches 0xFFFF
#define PFM_AUDIO_METADATA_ADDR 0x0000      // Offset from 0x380000 in EEPROM // Metadata stored here

uint16_t gpr11_ping __at(0x0B00);           // GPR11 is ping buffer
uint16_t gpr12_pong __at(0x0C00);           // GPR12 is pong buffer

uint16_t gpr_bank36 __at(0x2400);
uint16_t gpr_bufferRam __at(0x2500);

// External Memory Macros and variables
#include "SST26VF064B.h"
#define EXTMEM_ENABLE           true

#define EXTMEM_BLOCK_SIZE       256         // Page size (in bytes) in external memory
#define EXTMEM_START_ADDR       0x0         // First available memory location
#define EXTMEM_END_ADDR         0x7FFFFF    // Last available memory location
#define EXTMEM_SIZE_PAGES       32768       // Total number of pages available
#define EXTMEM_METADATA_ADDR    0x0010      // Offset from 0x380000 in EEPROM // Metadata stored here

bool extMem = true;                        // Is external memory present?

// Application macros and variables

#define DELAY_4s                0x0BDC      // TMR1H:L values for wait times
#define DELAY_3s                0x48E5      // at CLK=MFINTOSC_31.25kHz
#define DELAY_500ms             0xE17B      // and 1:2 prescaler
#define DELAY_400ms             0xE796      // Used to time the buttons
#define DELAY_300ms             0xEDB0
#define ERASE_FLASH_BLOCKSIZE    128        // Page or "Block" size in PFM
#define END_FLASH                0x020000   // Ending Address 

#define PrintChar               UART1_Write // Print debug char into UART

bool volatile transferToStorage = false;
bool volatile tickOccured = false;

extern bool sw0_pressed;                    // Defined in clc1.c
extern bool sw0_released; 
extern bool sw1_pressed;                    // Defined in clc2.c
extern bool sw1_released; 

typedef struct {                            // Metadata about stored audio
    uint32_t audioStartAddr;
    uint16_t audioSize_pages;
} Metadata;
Metadata pfmAudio, extMemAudio;             // Separate metadata for PFM and extMem

typedef enum operatingMode {Idle, Record, Playback, Erase, Passthrough} Mode;
typedef enum sourceReg {ping, pong} SourceReg;
Mode mode = Idle;

/**
 * @brief This is the TMR0 user defined ISR
 * @return None
 * @param None
 * @example Called from TMR0_ISR();
 */
void TimerTick_ISR(void) 
{
    DBG(IO_RD0_SetHigh());
    
    tickOccured = true;      // This flag is cleared elsewhere in code wherever applicable

    static volatile uint16_t count = 0;
    
    if (++count >= GPR_PFM_BLOCK_SIZE)
    {
        count = 0;
        if(!transferToStorage) {            // TODO: Why this logic? Replace this logic with DMA transfer counts
            transferToStorage = true;
        } 
    }
    
    DBG(IO_RD0_SetLow());
    return;
}

/**
 * @brief This inline routine stalls program execution until a timer tick occurs
 * @return None
 * @param None
 * @example WaitForTick();
 */
void inline WaitForTick()
{
    // Stall the program execution until a timer tick occurs
    while(!tickOccured);
    tickOccured = false;
}

/**
 * @brief This is the TMR6 user defined ISR
 * @return None
 * @param None
 * @example Called from TMR6_ISR();
 */
void BlinkTimer_ISR(void)
{
    LED0_Toggle();
}

/**
 * @brief This function starts the timer to blink LED0
 * @return None
 * @param None
 * @example LED0_Blink_Start();
 */
inline void LED0_Blink_Start() 
{
    Timer6_Start();
}

/**
 * @brief This function stops the timer to blink LED0
 * @return None
 * @param None
 * @example LED0_Blink_Stop();
 */
inline void LED0_Blink_Stop()
{
    Timer6_Stop();
    LED0_TurnOff();
}

/**
 * @brief This clears IF flag, stops, reloads, and starts TMR1
 * @return None
 * @param [in] 16-bit TMR1H:L value
 * @example TMR1_StopAndStartTimer(DELAY_3s);
 */
inline void TMR1_StopAndStartTimer(uint16_t delay)
{
    // Clearing IF flag.
    PIR3bits.TMR1IF = 0;
    
