microchip-pic-avr-examples/pic18f57q43-audio-record-playback/pic18f56q43-audio-record-playback-melody.X/main.c
    // Stop, reload, start
    TMR1_Stop();
    TMR1_Write(delay);
    TMR1_Start();
}

/**
 * @brief This clears all pressed/released flags of all switches
 * @return None
 * @param None
 * @example ResetSwitches();
 */
inline void ResetSwitches()
{
    sw0_pressed = false;
    sw0_released = false;
}

/**
 * @brief This routine resets a specified DMA instance by disabling and enabling the DMA
 * @return None
 * @param None
 * @example ResetDMA(0x01); // Resets DMA2
 */
void inline ResetDMA(uint8_t dma)
{
    // Max up to DMA6
    if(dma > MAX_DMA-1)
        return;
    
    DMASELECT = dma;
    DMAnCON0bits.EN = 0;
    DMAnCON0bits.EN = 1;
}

/**
 * @brief This routine disables, stops, re-enables all DMAs
 * @return None
 * @param None
 * @example ResetAllDMA();
 */
void inline ResetAllDMA()
{
    for(int8_t dma = MAX_DMA-1; dma >= 0; dma--) {
        DMASELECT = dma;
        DMAnCON0bits.EN = 0;
        DMAnCON0bits.SIRQEN = 0; 
        DMAnCON0bits.DGO = 0;
        DMAnCON0bits.EN = 1;
    }
}

/**
 * @brief This routine writes one word from NVMDAT to given address of Program Flash Memory
 * @return
 * @param [in] Target address in Program Flash Memory
 * @example FLASH_WriteWord_ByWord(flashAddr);
 */


void FLASH_WriteWord_ByWord(uint32_t flashAddr)
{
    uint8_t GIEBitValue = INTCON0bits.GIE; // Save interrupt enable

    //Set NVMADR with the target word address
    NVMADRU = (uint8_t) ((flashAddr & 0x00FF0000) >> 16);
    NVMADRH = (uint8_t) ((flashAddr & 0x0000FF00) >> 8);
    NVMADRL = (uint8_t) (flashAddr & 0x000000FF);

    //Set the NVMCMD control bits for Write Word operation
    NVMCON1bits.NVMCMD = 0b011;

    //Disable all interrupt
    INTCON0bits.GIE = 0;

    //Perform the unlock sequence
    NVMLOCK = 0x55;
    NVMLOCK = 0xAA;

    //Start page programming and wait for the operation to complete
    NVMCON0bits.GO = 1;
    while (NVMCON0bits.GO);

    //Restore the interrupts
    INTCON0bits.GIE = GIEBitValue;

    //Set the NVMCMD control bits for Word Read operation to avoid accidental writes
    NVMCON1bits.NVMCMD = 0b000;
}

/**
 * @brief This routine writes one block from Buffer RAM to given address of Program Flash Memory word-by-word
 * @return
 * @param [in] Starting address of a Program Flash Memory block
 * @example FLASH_WritePage_ByWord(flashAddr);
 */
int8_t FLASH_WritePage_ByWord(uint32_t flashAddr)
{
    uint16_t *bufferRamPtr = (uint16_t*) & gpr_bufferRam;
    uint32_t blockStartAddr = (uint32_t) (flashAddr & ((END_FLASH - 1) ^ ((ERASE_FLASH_BLOCKSIZE * 2) - 1)));
    uint8_t i;

    //Block write must start at the beginning of a row
    if (flashAddr != blockStartAddr)
    {
        return -1;
    }
    
    //Erase the given block
    //FLASH_EraseBlock(flashAddr);  //Removed cuz this block is cleared prior to function call

    //Copy Buffer RAM into NVMDAT one word at a time
    for (i = 0; i < ERASE_FLASH_BLOCKSIZE; i++) // ERASE_FLASH_BLOCKSIZE = 128
    {
        NVMDAT = *bufferRamPtr++;
        
        // Proceed only if a timer tick event occurs
        WaitForTick();
        
        DBG(IO_RD3_SetHigh());
        //Write NVMDAT contents to given Program Flash Memory location
        FLASH_WriteWord_ByWord(flashAddr);
        flashAddr+=2;
        DBG(IO_RD3_SetLow());
    }

    return 0;
}

/**
 * @brief This routine erases specified number of pages from given address of Program Flash Memory
 * @return
 * @param [in] Starting address of a Program Flash Memory block
 * @param [in] Number of pages to erase
 * @example FLASH_ErasePages(PFM_AUDIO_START_ADDR, PFM_AUDIO_SIZE_PAGES);
 */
void FLASH_ErasePages(uint32_t flashAddr, uint16_t numPages)
{
    if(numPages > PFM_AUDIO_SIZE_PAGES) {
        numPages = PFM_AUDIO_SIZE_PAGES;
    }
    
    for(uint16_t i = 0; i < numPages; i++) {
        FLASH_PageErase(flashAddr);
        flashAddr += GPR_PFM_BLOCK_SIZE;
    }
}


/**
 * @brief This routine transfers ping/pong buffer contents to buffer RAM
 * @return None
 * @param None
 * @example PingPong2BufferRam();
 */
void inline PingPong2BufferRam()
{
    DBG(IO_RD3_SetHigh());
    DMASELECT = DMA5;
    DMAnCON0bits.DGO = 1;
    while(DMAnCON0bits.DGO == 1);   // DGO cleared when DCNT=1
    DBG(IO_RD3_SetLow());
}

/**
 * @brief This routine transfers ping/pong buffer contents to SPITX
 * @return None
 * @param None
 * @example PingPong2SPI();
 */
void inline PingPong2SPI()
{
    DBG(IO_RD3_SetHigh());
    
    static SourceReg src = ping;
    
    // Prepare SPI to transmit a block of data
    while(SPI1CON2bits.BUSY);
    SPI1CON2bits.RXR = 0;
    SPI1TCNT = GPR_PFM_BLOCK_SIZE;
    
    // Prepare DMA for transfer
    PIR11bits.DMA4SCNTIF = 0;
    DMASELECT = DMA4;
    DMAnCON0bits.EN = 0;
    if(src == ping) DMAnSSA = &gpr11_ping;  // Update DMA source addr
    else DMAnSSA = &gpr12_pong;
    
    // Invoke DMA transfer
    DMAnCON0bits.EN = 1;
    DMAnCON0bits.SIRQEN = 1;
    while(PIR11bits.DMA4SCNTIF == 0);
    PIR11bits.DMA4SCNTIF = 0;

    // Reset SPI to Full Duplex
    while(SPI1CON2bits.BUSY);
    SPI1CON2bits.RXR = 1;
    
    // Update source reg for next transfer
    if(src == ping) src = pong;
    else src = ping;
           
    DBG(IO_RD3_SetLow());
}

/**
 * @brief This routine selects appropriate microphone input based on hardware jumper
 * @return None
 * @param None
 * @example AUDIO_SelectMicInput();
 */
void inline AUDIO_SelectMicInput()
{
    if(Mic_SEL_GetValue())
        ADPCH = channel_MIC2_AND7;
    else
        ADPCH = channel_MIC_ANA0;
}

/**
 * @brief This routine reads the metadata of the stored audio
 * @return None
 * @param None
 * @example AUDIO_ReadMetaData();
 */
void AUDIO_ReadMetaData()
{
    if(extMem)
    {
        extMemAudio.audioStartAddr  = ((uint32_t)EEPROM_Read(EXTMEM_METADATA_ADDR))   << 24;
        extMemAudio.audioStartAddr += ((uint32_t)EEPROM_Read(EXTMEM_METADATA_ADDR+1)) << 16;
        extMemAudio.audioStartAddr += ((uint32_t)EEPROM_Read(EXTMEM_METADATA_ADDR+2)) << 8;
        extMemAudio.audioStartAddr += ((uint32_t)EEPROM_Read(EXTMEM_METADATA_ADDR+3));
        
        extMemAudio.audioSize_pages = ((uint32_t)EEPROM_Read(EXTMEM_METADATA_ADDR+4)) << 8;
        extMemAudio.audioSize_pages+= ((uint32_t)EEPROM_Read(EXTMEM_METADATA_ADDR+5));
        
