microchip-pic-avr-examples/pic18f57q43-audio-record-playback/pic18f56q43-audio-record-playback-melody.X/main.c
        // Did EEPROM return all 0xFF? Then it is blank and no metadata exists
        // In that case initialize metadata here
        if(extMemAudio.audioStartAddr == 0xFFFFFFFF && extMemAudio.audioSize_pages == 0xFFFF) {
            extMemAudio.audioStartAddr = EXTMEM_START_ADDR;
            extMemAudio.audioSize_pages = 0;
        }
    }
    else
    {
        pfmAudio.audioStartAddr  = ((uint32_t)EEPROM_Read(PFM_AUDIO_METADATA_ADDR))   << 24;
        pfmAudio.audioStartAddr += ((uint32_t)EEPROM_Read(PFM_AUDIO_METADATA_ADDR+1)) << 16;
        pfmAudio.audioStartAddr += ((uint32_t)EEPROM_Read(PFM_AUDIO_METADATA_ADDR+2)) << 8;
        pfmAudio.audioStartAddr += ((uint32_t)EEPROM_Read(PFM_AUDIO_METADATA_ADDR+3));
        
        pfmAudio.audioSize_pages = ((uint32_t)EEPROM_Read(PFM_AUDIO_METADATA_ADDR+4)) << 8;
        pfmAudio.audioSize_pages+= ((uint32_t)EEPROM_Read(PFM_AUDIO_METADATA_ADDR+5));
        
        // Did EEPROM return all 0xFF? Then it is blank and no metadata exists
        // In that case initialize metadata here
        if(pfmAudio.audioStartAddr == 0xFFFFFFFF && pfmAudio.audioSize_pages == 0xFFFF) {
            pfmAudio.audioStartAddr = PFM_AUDIO_START_ADDR;
            pfmAudio.audioSize_pages = 0;
        }
    }
}

/**
 * @brief This routine updates the metadata of the stored audio
 * @return None
 * @param None
 * @example AUDIO_UpdateMetaData();
 */
void AUDIO_UpdateMetaData()
{
    if(extMem)
    {
        EEPROM_Write(EXTMEM_METADATA_ADDR,   extMemAudio.audioStartAddr >> 24);
        EEPROM_Write(EXTMEM_METADATA_ADDR+1, extMemAudio.audioStartAddr >> 16);
        EEPROM_Write(EXTMEM_METADATA_ADDR+2, extMemAudio.audioStartAddr >> 8);
        EEPROM_Write(EXTMEM_METADATA_ADDR+3, extMemAudio.audioStartAddr);
        
        EEPROM_Write(EXTMEM_METADATA_ADDR+4, extMemAudio.audioSize_pages >> 8);
        EEPROM_Write(EXTMEM_METADATA_ADDR+5, extMemAudio.audioSize_pages);
    }
    else
    {  
        EEPROM_Write(PFM_AUDIO_METADATA_ADDR,   pfmAudio.audioStartAddr >> 24);
        EEPROM_Write(PFM_AUDIO_METADATA_ADDR+1, pfmAudio.audioStartAddr >> 16);
        EEPROM_Write(PFM_AUDIO_METADATA_ADDR+2, pfmAudio.audioStartAddr >> 8);
        EEPROM_Write(PFM_AUDIO_METADATA_ADDR+3, pfmAudio.audioStartAddr);
        
        EEPROM_Write(PFM_AUDIO_METADATA_ADDR+4, pfmAudio.audioSize_pages >> 8);
        EEPROM_Write(PFM_AUDIO_METADATA_ADDR+5, pfmAudio.audioSize_pages);
    }
}

/**
 * @brief This routine services Erase mode and whenever erase is needed
 * @return None
 * @param None
 * @example AUDIO_Erase();
 */
void AUDIO_Erase()
{
    DBG(PrintChar('E'));
    
    // Reset any pre-existing switch states
    ResetSwitches();
    
    // Clear all pages for storage
    LED0_Blink_Start();
    
    if(extMem) {
         DBG(PrintChar('W'));
      
        SST26VF064B_ChipErase();
        while( SST26VF064B_Busy() );    // Wait for Erase to finish
        
        // Update metadata
        extMemAudio.audioStartAddr = EXTMEM_START_ADDR;
        extMemAudio.audioSize_pages = 0;
    } 
    else {
         DBG(PrintChar('L'));
        FLASH_ErasePages(PFM_AUDIO_START_ADDR, PFM_AUDIO_SIZE_PAGES);
        
        // Update metadata
        pfmAudio.audioStartAddr = PFM_AUDIO_START_ADDR;
        pfmAudio.audioSize_pages = 0;
    }
    
    
    AUDIO_UpdateMetaData();     // Save metadata to EEPROM
    
    LED0_Blink_Stop();
    
    DBG(PrintChar('x'));
    
    // Change mode to Idle only if current mode is Erase
    // Retain current mode for all other modes.
    // This is because Erase can be called from other modes too.
    if(mode == Erase) {
        mode = Idle;
    }
}

/**
 * @brief This routine services Idle mode
 * @return None
 * @param None
 * @example AUDIO_Idle();
 */
void AUDIO_Idle()
{
    // Monitor switches to change modes
    // SW0 = Record/Play/Erase Button
    // Single press = Playback
    // Double press = Record
    // Long press = Erase
    if(sw0_pressed) {
        sw0_pressed = false;                            
        sw0_released = false;                           // Ensure sw0 is reset
        TMR1_StopAndStartTimer(DELAY_3s);               // Start 3s timer
        while(!TMR1_HasOverflowOccured()){
            if(sw0_released){                           // sw0 released before 3s timer could elapse
                sw0_released = false;
                LED0_Blink_Start();                     // Blink LED to show transition phase
                TMR1_StopAndStartTimer(DELAY_500ms);    // Start 500ms timer
                while(!TMR1_HasOverflowOccured()){
                    if(sw0_pressed) {                   // sw0 pressed again within 500ms - double press detected
                        sw0_pressed = false;
                        mode = Record;
                        TMR1_Stop();
                        LED0_Blink_Stop();              // Stop LED blink to end transition phase
                        return;
                    }
                }
                mode = Playback;                        // sw0 not pressed within 500ms - single press detected
                TMR1_Stop();
                LED0_Blink_Stop();                      // Stop LED blink to end transition phase
                return;
            }  
        }
        mode = Erase;                                   // 3s timer elapsed and sw0 did not get released - long press detected
        TMR1_Stop();
        return;
    }
    
    // SW1 = Passthrough Button
    // Long press = Passthrough
    else if(sw1_pressed) {
        sw1_pressed = false;                            
        sw1_released = false;                           // Ensure sw1 is reset
        TMR1_StopAndStartTimer(DELAY_3s);               // Start 3s timer
        while(!TMR1_HasOverflowOccured()){
            if(sw1_released) {                          // sw1 released before 3s timer could elapse - single press detected
                sw1_released = false;
                return;
            }
        }
        mode = Passthrough;                             // 3s timer elapsed and sw0 did not get released - long press detected
        TMR1_Stop();
        return;
    }
}

/**
 * @brief This routine services Record mode. This is non-blocking implementation.
 * @return None
 * @param None
 * @example AUDIO_Record();
 */
void AUDIO_Record()
{
    DBG(PrintChar('R'));
    
