microchip-pic-avr-examples/pic18f57q43-audio-record-playback/pic18f56q43-audio-record-playback-melody.X/main.c
    // Reset any pre-existing switch states
    ResetSwitches();
    
    // Start by erasing the existing data in flash
    AUDIO_Erase();
    
    // Initialize writing to memory
    uint32_t flashAddr;
    uint32_t maxFlashAddr;
    uint16_t numPagesWritten = 0;
    uint16_t *bufferRamPtr;
    uint32_t blockStartAddr;
    uint16_t maxAudioSize;
    uint16_t i = 0;
    
    if(extMem)
    {
        flashAddr = EXTMEM_START_ADDR;
        maxFlashAddr = EXTMEM_END_ADDR;
        maxAudioSize = EXTMEM_SIZE_PAGES;
        extMemAudio.audioStartAddr = flashAddr;     // metadata
    }
    else
    {
        flashAddr = PFM_AUDIO_START_ADDR;
        maxFlashAddr = PFM_AUDIO_END_ADDR;
        maxAudioSize = PFM_AUDIO_SIZE_PAGES;
        pfmAudio.audioStartAddr = flashAddr;        // metadata
    }
    
    // Select microphone input channel
    AUDIO_SelectMicInput();

    // Enable ADC
    ADCON0bits.ON = 1;
    
    // Reset relevant DMAs
    ResetDMA(DMA2);     // DMA2 (ADC to ping/pong)
    ResetDMA(DMA4);     // DMA4 (ping/pong to SPI)
    ResetDMA(DMA5);     // DMA5 (ping/pong to BufferRAM)
    
    // Reset and start sampling timer and DMA
    DMA2_StartTransferWithTrigger();
    TMR0_Reload();
    TMR0_Start();
    LED0_TurnOn();
    
    // Writing loop
    // This is non-blocking implementation 
    // Break out if record button is pressed again 
    // [or] if reached the end of allocated memory
    while(!sw0_pressed && (flashAddr < maxFlashAddr)){
    
        
        // Keep checking for when to write to storage
        // transferToStorage flag is set in ISR
        if(transferToStorage) {
            
            // Transfer to external memory if present
            if(extMem) {
                DBG(IO_RD1_SetHigh());
                
                // Initialize external memory
                while( SST26VF064B_Busy() );
                SST26VF064B_WriteEnable();
                SST26VF064B_CS_Low();
                SST26VF064B_PageProgram_Cmd();
                SST26VF064B_WriteAddress(flashAddr);
                
                // Transfer ping/pong to SPI
                PingPong2SPI(); 
                
                // Close out transfer
                SST26VF064B_CS_High();
                while( SST26VF064B_Busy() );    // Wait for pending transfer to complete
                numPagesWritten++;              // Increment number of pages written
                flashAddr += EXTMEM_BLOCK_SIZE; // Update flashAddr to new location
                transferToStorage = false;      // Clear flag
                DBG(IO_RD1_SetLow());               
            }
            
            // Otherwise transfer to internal memory
            else {
                // First, transfer ping/pong to buffer RAM
                if(i == 0) {
                    // Initialize memory
                    bufferRamPtr = (uint16_t*) & gpr_bufferRam;
                    blockStartAddr = (uint32_t) (flashAddr & ((END_FLASH - 1) ^ ((ERASE_FLASH_BLOCKSIZE * 2) - 1)));

                    //Block write must start at the beginning of a row
                    if (flashAddr != blockStartAddr)
                    {
                        return;
                    }

                    DBG(IO_RD1_SetHigh());

                    // Proceed only if a timer tick event occurs
                    WaitForTick();

                    // Transfer ping/pong to buffer RAM
                    PingPong2BufferRam();
                }

                // Next, write buffer RAM contents to PFM one word at a time
                if(i < ERASE_FLASH_BLOCKSIZE) // ERASE_FLASH_BLOCKSIZE = 128
                {
                    // Transfer word to NVMDAT
                    NVMDAT = *bufferRamPtr++;

                    // Proceed only if a timer tick event occurs
                    WaitForTick();

                    DBG(IO_RD3_SetHigh());

                    //Write NVMDAT contents to given Program Flash Memory location
                    FLASH_WriteWord_ByWord(flashAddr);

                    // Increment flash write address and word counter
                    flashAddr+=2;
                    i++;
                    DBG(IO_RD3_SetLow());

                    // Check for PFM write error
                    if(NVMCON1bits.WRERR == 1) {
                        // Write Error Detected - Do whatever appropriate
                        NVMCON1bits.WRERR = 0;
                        DBG(IO_RD3_Toggle());
                    }

                }

                // End when entire bufferRAM has been written to PFM
                else {
                    // Increment number of pages written
                    numPagesWritten++;

                    // Reset word counter
                    i = 0;

                    // Clear flag
                    transferToStorage = false;
                    DBG(IO_RD1_SetLow());
                }        
            }
        }
    }
    
    // Stop sampling timer and DMA
    DMA2_StopTransfer();
    TMR0_Stop();
    TMR0_Reload();
    LED0_TurnOff();
    
    // Disable ADC
    ADCON0bits.ON = 0;
    
    // Save metadata for recorded audio
    if(extMem)
        extMemAudio.audioSize_pages = numPagesWritten;
    else
        pfmAudio.audioSize_pages = numPagesWritten;
    
    AUDIO_UpdateMetaData();
    
    // Reset any lurking switch states
    ResetSwitches();

    // Change operation mode back to Idle
    mode = Idle;
    DBG(PrintChar('x'));
}

/**
 * @brief This routine services Playback mode
 * @return None
 * @param None
 * @example AUDIO_Playback();
 */
void AUDIO_Playback()
{
    DBG(PrintChar('P'));
    
    // Reset any pre-existing switch states
    ResetSwitches();
    
    // Initialize playback from memory
    uint32_t flashAddr;
    uint16_t numPages;
    
    
    
    if(extMem)
    {
        flashAddr = extMemAudio.audioStartAddr;
        numPages = extMemAudio.audioSize_pages;
    }
    else
    {
        flashAddr = pfmAudio.audioStartAddr;
        numPages = pfmAudio.audioSize_pages;
    }
    
    // Enable PWM for power amplifier
    PWM2_16BIT_Enable();
    
    // Enable DAC
    DAC1CONbits.EN = 1;
    
    // Reset relevant DMAs
    ResetDMA(DMA3);     // DMA3 (SPI to DAC)
    ResetDMA(DMA6);     // DMA6 (PFM to DAC)
    
    // Reset and start sampling timer
    TMR0_Reload();
    TMR0_Start();
    LED0_TurnOn();
    
    if(extMem) {
        while( SST26VF064B_Busy() );

        SST26VF064B_CS_Low();
        SST26VF064B_Read_Cmd( );
        SST26VF064B_WriteAddress(flashAddr);
        
