microchip-pic-avr-examples/pic18f57q43-audio-record-playback/pic18f56q43-audio-record-playback-melody.X/main.c
        // Prepare SPI to receive a block of data
        while(SPI1CON2bits.BUSY);
        SPI1CON2bits.TXR = 0;
         
        // Read one page at a time
        for(uint16_t i = numPages; i > 0; i--)
        {
            // Kick off SPI in Receive-only mode            
            SPI1TCNT = EXTMEM_BLOCK_SIZE;
            
            // Kick off DMA (SPI to DAC)
            PIR10bits.DMA3SCNTIF = 0;
            DMASELECT = DMA3;
            DMAnCON0bits.SIRQEN = 1;
            while(PIR10bits.DMA3SCNTIF == 0);
            PIR10bits.DMA3SCNTIF = 0;
            
            // Break out if playback button is pressed again
            if(sw0_pressed) {
                sw0_pressed = false;
                break;
            }
            
        }
        
        // Reset SPI to Full Duplex
        while(SPI1CON2bits.BUSY);
        SPI1CON2bits.TXR = 1;
        
        SST26VF064B_CS_High();
    }
    else {
        // Where to start from?
        DMASELECT = DMA6;
        DMAnSSA = flashAddr;

        // Read data from PFM one page at a time using DMA
        for(uint16_t i = numPages; i > 0; i--)
        {
            DBG(IO_RD3_SetHigh());
            PIR13bits.DMA6SCNTIF = 0;
            DMASELECT = DMA6;
            DMAnCON0bits.SIRQEN = 1;            // Enable auto-transfer
            DMAnSSA += GPR_PFM_BLOCK_SIZE;      // Update source pointer for next transfer
            while(PIR13bits.DMA6SCNTIF == 0);
            PIR13bits.DMA6SCNTIF = 0;
            DBG(IO_RD3_SetLow());
            
            // Break out if playback button is pressed again
            if(sw0_pressed) {
                sw0_pressed = false;
                break;
            }
        }
    }
    
    // Stop sampling timer
    TMR0_Stop();
    TMR0_Reload();
    LED0_TurnOff();
    
    // Disable DAC
    DAC1CONbits.EN = 0;
    
    // Disable PWM for power amplifier
    PWM2_16BIT_Disable();
    
    // Reset any lurking switch states
    ResetSwitches();
    
    // Change operation mode back to Idle
    mode = Idle;
    DBG(PrintChar('x'));
}

/**
 * @brief This routine services Passthrough mode
 * @return None
 * @param None
 * @example AUDIO_Playback();
 */
void AUDIO_Passthrough()
{
    DBG(PrintChar('T'));
    
    // Reset switch states
    ResetSwitches();
    
    // Select microphone input channel
    AUDIO_SelectMicInput();
    
    // Enable PWM for power amplifier
    PWM2_16BIT_Enable();
    
    // Enable ADC and DAC
    ADCON0bits.ON = 1;
    DAC1CONbits.EN = 1;
    
    // Reset relevant DMAs
    ResetDMA(0x00);     // DMA1 (ADC to DAC)
    
    // Reset and start sampling timer and DMA
    DMA1_StartTransferWithTrigger();
    TMR0_Reload();
    TMR0_Start();
    LED0_TurnOn();
    
    // DMA1 kicks in and does the magic here
    
    // Continue until sw0 is pressed again
    while(!sw0_pressed);
    sw0_pressed = false;
    
    // Stop DMA and sampling timer
    DMA1_StopTransfer();
    TMR0_Stop();
    TMR0_Reload();
    LED0_TurnOff();
    
    // Disable ADC and DAC
    ADCON0bits.ON = 0;
    DAC1CONbits.EN = 0;
    
    // Disable PWM for power amplifier
    PWM2_16BIT_Disable();
    
    // Reset switch states
    ResetSwitches();
    
    // Change operation mode back to Idle
    mode = Idle;
    DBG(PrintChar('x'));
}


/**
 * @brief This routine initializes the application
 * @return None
 * @param None
 * @example APP_Initialize();
 */
void APP_Initialize()
{
    // Stop and reset sampling timer
    TMR0_Stop();
    TMR0_Reload();
    
    // Stop other timers as needed
    TMR1_Stop();
    
    // Disable ADC and DAC 
    ADCON0bits.ON = 0;
    DAC1CONbits.EN = 0;
    
    // Disable PWM for power amplifier
    PWM2_16BIT_Disable();
    
    // Reset all DMAs
    ResetAllDMA();
    
    // Reset all switches
    ResetSwitches();
    
    // Set custom Timer ISRs
    TMR0_OverflowCallbackRegister(TimerTick_ISR);
    Timer6_OverflowCallbackRegister(BlinkTimer_ISR);
    
    // Initialize external memory
    #if EXTMEM_ENABLE
    extMem = SST26VF064B_Initialize();
    if(extMem) {
        SST26VF064B_GlobalBlockUnlock();
    }
    #endif

    // Read metadata for stored audio
    AUDIO_ReadMetaData();

    // Clear all pages for storage // DO NOT CLEAR IF MEMORY IS TO BE RETAINED
    //AUDIO_Erase();
    
    // Set default operating mode
    mode = Idle;
}

/*
                         Main application
 */
void main(void)
{
    // Initialize the device
    SYSTEM_Initialize();

    // If using interrupts in PIC18 High/Low Priority Mode you need to enable the Global High and Low Interrupts
    // If using interrupts in PIC Mid-Range Compatibility Mode you need to enable the Global Interrupts
    // Use the following macros to:

    // Enable high priority global interrupts
    INTERRUPT_GlobalInterruptHighEnable();

    // Enable low priority global interrupts.
    
    
    // Disable high priority global interrupts
    //INTERRUPT_GlobalInterruptHighDisable();

    // Disable low priority global interrupts.
    //INTERRUPT_GlobalInterruptLowDisable();
        

    
    //// APPLICATION CODE //////////////////////////////////////////////////////
    
    // Initialize application
    APP_Initialize();

    
//    CLC1_CLCI_SetInterruptHandler(CLC1_ISR);
//    CLC2_CLCI_SetInterruptHandler(CLC2_ISR);
    
    while (1)
    {
        if(mode == Idle) {
            AUDIO_Idle();
        }
        
        else if(mode == Record) {
            AUDIO_Record();
        }
        
        else if(mode == Playback) {
            AUDIO_Playback();
        }
        
        else if(mode == Erase) {
            AUDIO_Erase();
        }
        
        else if(mode == Passthrough) {
            AUDIO_Passthrough();
        }
        
        else {
            
        }
    }
}


/**
 End of File
*/